app/Controllers/DatosController.php

SELECT `id`, `temp`, `fecha`
FROM `temperatura`
---
    public function lines()
    {
        $json = array();
        $builder = $this->db->table('temperatura');
        $builder->select('id, temp, fecha');
        $data = $builder->get()->getResult();